Revit 2026 API

# ViewportGetProjectionToSheetTransform Method

---

Returns the transform from the view's projection space to the sheet space.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Transform GetProjectionToSheetTransform()
```
```vb
Public Function GetProjectionToSheetTransform As Transform
```
```cpp
public:
Transform^ GetProjectionToSheetTransform()
```
```fsharp
member GetProjectionToSheetTransform : unit -> Transform
```

#### Return Value

Transform The transform from the view's projection space to the sheet space.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The viewport is not on a sheet. -or- The viewport does not have transforms. |

This transform accounts for the position and rotation of a viewport on a sheet.

The transforms from the model space to the view projection space are returned by [!:View.GetModelToProjectionTransforms()].

#### Reference

Viewport Class

Autodesk.Revit.DB Namespace